a = [[],[],[],[],[]] #초기화가 안되어 있음
#리스트 공간 초기화를 먼저 해줘야함
# a=[[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0],[0,0,0,0,0]]
# a = [[0]*5]*5 # 얕은 복사
a = [[0]*5 for _ in range(5)]#컴프리헨션
for i in range(0,5): # 0,1,2,3,4
    for j in range(0,5): # 0,1,2,3,4
        #a[0][0] = 1
        #a[0][1] = 2
        #a[0][2] = 3
        #a[0][3] = 4
        #a[0][4] = 5
        #a[1][0] = 6
        a[i][j] = (5*i)+j+1
print(a) 

value = 1
for i in range(0,5):
    for j in range(0,5):
        a[i][j]= value
        value +=1