students = [[1,'홍길동',100,100,99,299,99.67,1],[2,'유관순',90,90,90,270,90.0,1],
            [3,'이순신',80,80,80,240,80.0,1],[4,'김구',70,70,70,210,70.0,1],
            [5,'이이',60,60,60,180,60.0,1],[6,'강감찬',50,50,50,150,50.0,1]]

# 등수처리
while True:
    choice = input ('등수처리를 실행하겠습니까? (1.실행 0.취소)')
    if choice == '0':
        print('등수처리를 취소하셨습니다.')
        break
    else:
    # 등수처리 진행
        for i, i_stu in students:
            no = 1 #초기화
            for j,j_stu in students:
               if i_stu[5] < j_stu[5]:
                   no =+ 1 #비교대상이 총합이 더 크면 1증가
            i_stu[7] = no # 등수위치에 no 저장
print('등수처리가 완료되었습니다')
print('-'*40)
print('[ 등수확인 ]')
print(students)